JaKaczocha/LPC55S69/tests/projectLPS25HB/board/pin_mux.h
/*! @name PIO0_2 (number 81), U6[11]/P20[5]/FC3_SPI_MISO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMODPINS_LCD_DC_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMODPINS_LCD_DC_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMODPINS_LCD_DC_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMODPINS_LCD_DC_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPMODPINS_LCD_DC_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_28 (number 73), P17[18]/P20[2]/PLU_IN3/GPIO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMODPINS_LCD_RST_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMODPINS_LCD_RST_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMODPINS_LCD_RST_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMODPINS_LCD_RST_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPMODPINS_LCD_RST_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMODPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
